# Unlimited Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanViewRange..::..Unlimited Property
PlanViewRange Class See Also
---
View range is unlimited
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ElementId Unlimited { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Unlimited As ElementId
	Get
```

Visual C++
---
```text
public:
static property ElementId^ Unlimited {
	ElementId^ get ();
}
```

# See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace